In [3]:
import pandas as pd
import numpy as np
import os
print("pustaka berhasil dimuat")

pustaka berhasil dimuat

In [4]:
# baca dataset
folder = os.path.join("..", "data")
file = "Data_Preprocessing1.csv"
path = os.path.join(folder, file)

#baca data
df = pd.read_csv(path)
df.head(5)

,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total,Waktu
0,234465,614960,2675459,2860007,2842876,1204140,297185,375601,11104693,2006-02-01
1,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000,2006-08-01
2,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917,2007-02-01
3,94301,438519,2179792,2264198,2532204,1538349,397191,566588,10011142,2007-08-01
4,79764,448431,2216748,2166619,2204377,1165582,519867,626202,9427590,2008-02-01

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  35 non-null     int64
 1   Tidak/belum tamat SD        35 non-null     int64
 2   SD                          35 non-null     int64
 3   SLTP                        35 non-null     int64
 4   SLTA Umum/SMU               35 non-null     int64
 5   SLTA Kejuruan/SMK           35 non-null     int64
 6   Akademi/Diploma             35 non-null     int64
 7   Universitas                 35 non-null     int64
 8   Total                       35 non-null     int64
 9   Waktu                       35 non-null     object
dtypes: int64(9), object(1)
memory usage: 2.9+ KB

In [6]:
# konversi tipe data waktu ->datetime
df["Waktu"] = pd.to_datetime(df["Waktu"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  35 non-null     int64
 1   Tidak/belum tamat SD        35 non-null     int64
 2   SD                          35 non-null     int64
 3   SLTP                        35 non-null     int64
 4   SLTA Umum/SMU               35 non-null     int64
 5   SLTA Kejuruan/SMK           35 non-null     int64
 6   Akademi/Diploma             35 non-null     int64
 7   Universitas                 35 non-null     int64
 8   Total                       35 non-null     int64
 9   Waktu                       35 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(9)
memory usage: 2.9 KB

In [10]:
# pisahkan bagian Tahun jadi fitur/kolom baru
df["Tahun"] = df["Waktu"].dt.year
# cek hasilnya
df[["Waktu", "Tahun"]].head(5)

       Waktu  Tahun
0 2006-02-01   2006
1 2006-08-01   2006
2 2007-02-01   2007
3 2007-08-01   2007
4 2008-02-01   2008

In [16]:
# buat Fitur Lag
df["Total_lag1"] = df["Tahun"].shift(1)
# cek hasilnya
df[["Waktu","Tahun","Total_lag1"]].head(5)

       Waktu  Tahun  Total_lag1
0 2006-02-01   2006         NaN
1 2006-08-01   2006      2006.0
2 2007-02-01   2007      2006.0
3 2007-08-01   2007      2007.0
4 2008-02-01   2008      2007.0

In [17]:
# buat Fitur Pertumbuhan Tahunan (Growth Rate)
df["Growth_Rate"] = df["Total"].pct_change() * 100
# cek hasilnya 
df[["Tahun", "Total", "Growth_Rate"]].head(10)

   Tahun     Total  Growth_Rate
0   2006  11104693          NaN
1   2006  10932000    -1.555135
2   2007  10547917    -3.513383
3   2007  10011142    -5.088919
4   2008   9427590    -5.829025
5   2008   9394515    -0.350832
6   2009   9258964    -1.442874
7   2009   8962617    -3.200650
8   2010   8592490    -4.129676
9   2010   8319779    -3.173830

In [18]:
df

,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total,Waktu,Tahun,Tahun_lag1,Growth_Rate,Total_lag1
0,234465,614960,2675459,2860007,2842876,1204140,297185,375601,11104693,2006-02-01,2006,NaN,NaN,NaN
1,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000,2006-08-01,2006,2006.0,-1.555135,2006.0
2,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917,2007-02-01,2007,2006.0,-3.513383,2006.0
3,94301,438519,2179792,2264198,2532204,1538349,397191,566588,10011142,2007-08-01,2007,2007.0,-5.088919,2007.0
4,79764,448431,2216748,2166619,2204377,1165582,519867,626202,9427590,2008-02-01,2008,2007.0,-5.829025,2007.0
5,103206,443832,2099968,1973986,2403394,1409128,362683,598318,9394515,2008-08-01,2008,2008.0,-0.350832,2008.0
6,60347,415955,2143747,2054682,2133627,1337586,486399,626621,9258964,2009-02-01,2009,2008.0,-1.442874,2008.0
7,90471,547430,1531671,1770823,2472245,1407226,441100,701651,8962617,2009-08-01,2009,2009.0,-3.200650,2009.0
8,59066,547164,1522465,1657452,2111256,1336881,538186,820020,8592490,2010-02-01,2010,2009.0,-4.129676,2009.0
9,157586,600221,1402858,1661449,2149123,1195192,443222,710128,8319779,2010-08-01,2010,2010.0,-3.173830,2010.0
10,93956,559661,1291733,1834632,2385938,1109511,469009,635442,8379882,2011-02-01,2011,2010.0,0.722411,2010.0
11,205388,737610,1241882,2138864,2376254,1161362,276816,543216,8681392,2011-08-01,2011,2011.0,3.598022,2011.0
12,126972,601753,1418683,1736670,2043697,1018465,258385,553206,7757831,2012-02-01,2012,2011.0,-10.638398,2011.0
13,85374,512041,1452047,1714776,1867755,1067009,200028,445836,7344866,2012-08-01,2012,2012.0,-5.323202,2012.0
14,112435,523400,1421873,1821429,1874799,864649,197270,425042,7240897,2013-02-01,2013,2012.0,-1.415533,2012.0
15,81432,489152,1347555,1689643,1925660,1258201,185103,434185,7410931,2013-08-01,2013,2013.0,2.348245,2013.0
16,134040,610574,1374822,1693203,1893509,847365,195258,398298,7147069,2014-02-01,2014,2013.0,-3.560443,2013.0
17,74898,389550,1229652,1566838,1962786,1332521,193517,495143,7244905,2014-08-01,2014,2014.0,1.368897,2014.0
18,124303,603194,1320392,1650387,1762411,1174366,254312,565402,7454767,2015-02-01,2015,2014.0,2.896684,2014.0
19,55554,371542,1004961,1373919,2280029,1569690,251541,653586,7560822,2015-08-01,2015,2015.0,1.422647,2015.0
20,94293,557418,1218954,1313815,1546699,1348327,249362,695304,7024172,2016-02-01,2016,2015.0,-7.097773,2015.0
21,59346,384069,1035731,1294483,1950626,1520549,219736,567235,7031775,2016-08-01,2016,2016.0,0.108241,2016.0
22,92331,546897,1292234,1281240,1552894,1383022,249705,606939,7005262,2017-02-01,2017,2016.0,-0.377046,2016.0
23,62984,404435,904561,1274417,1910829,1621402,242937,618758,7005262,2017-08-01,2017,2017.0,0.000000,2017.0
24,43740,452326,975661,1265421,1672601,1445340,304744,803624,6963457,2018-02-01,2018,2017.0,-0.596766,2017.0
25,32315,328781,908228,1142168,1945826,1752241,223456,740370,7073385,2018-08-01,2018,2018.0,1.578641,2018.0
26,36422,443495,965641,1235199,1690527,1397281,274377,855854,6898796,2019-02-01,2019,2018.0,-2.468252,2018.0
27,40771,347712,865778,1137195,2008035,1739625,218954,746354,7104424,2019-08-01,2019,2019.0,2.980636,2019.0
28,35761,346778,1006744,1251352,1748834,1443522,267583,824912,6925486,2020-02-01,2020,2019.0,-2.518684,2019.0
29,31379,428813,1410537,1621518,2662444,2326599,305261,981203,9767754,2020-08-01,2020,2020.0,41.040701,2020.0
30,20461,342734,1219494,1515089,2305093,2089137,254457,999543,8746008,2021-02-01,2021,2020.0,-10.460399,2020.0
31,23905,431329,1393492,1604448,2472859,2111338,216024,848657,9102052,2021-08-01,2021,2021.0,4.070932,2021.0
32,24852,437819,1230914,1460221,2251558,1876661,235359,884769,8402153,2022-02-01,2022,2021.0,-7.689464,2021.0
33,15206,663125,1274153,1500807,2478173,1661492,159490,673485,8425931,2022-08-01,2022,2022.0,0.282999,2022.0
34,15206,663125,1274153,1500807,2478173,1661492,159490,673485,8425931,2022-08-01,2022,2022.0,0.000000,2022.0

In [19]:
# Hapus baris pertama (karena tidak punya data tahun sebelumnya)
df = df.dropna(subset=["Total_lag1", "Growth_Rate"]).reset_index(drop=True)

# Cek kembali dimensi data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 14 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  34 non-null     int64
 1   Tidak/belum tamat SD        34 non-null     int64
 2   SD                          34 non-null     int64
 3   SLTP                        34 non-null     int64
 4   SLTA Umum/SMU               34 non-null     int64
 5   SLTA Kejuruan/SMK           34 non-null     int64
 6   Akademi/Diploma             34 non-null     int64
 7   Universitas                 34 non-null     int64
 8   Total                       34 non-null     int64
 9   Waktu                       34 non-null     datetime64[ns]
 10  Tahun                       34 non-null     int32
 11  Tahun_lag1                  34 non-null     float64
 12  Growth_Rate                 34 non-null     float64
 13  Total_lag1                  34 non-null     float64
dtypes: datetime64[ns](1), float64(3), int32(1), int64(9)
memory usage: 3.7 KB

In [25]:
# verifikasi perubaha
# hapus kolom double
#df = df.drop(columns="Tahun_lag1")
df.head(2)

,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total,Waktu,Tahun,Growth_Rate,Total_lag1
0,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000,2006-08-01,2006,-1.555135,2006.0
1,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917,2007-02-01,2007,-3.513383,2006.0

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 13 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  34 non-null     int64
 1   Tidak/belum tamat SD        34 non-null     int64
 2   SD                          34 non-null     int64
 3   SLTP                        34 non-null     int64
 4   SLTA Umum/SMU               34 non-null     int64
 5   SLTA Kejuruan/SMK           34 non-null     int64
 6   Akademi/Diploma             34 non-null     int64
 7   Universitas                 34 non-null     int64
 8   Total                       34 non-null     int64
 9   Waktu                       34 non-null     datetime64[ns]
 10  Tahun                       34 non-null     int32
 11  Growth_Rate                 34 non-null     float64
 12  Total_lag1                  34 non-null     float64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(9)
memory usage: 3.4 KB

In [27]:
# simpan hasil Feature Engineering
df.to_csv("data_pengangguran_fe.csv", index=False)